estevaofv/JC1060P470C_I_W_7inch_10inch_9inch/1-Demo/Demo_IDF/examples/lvgl_demo_v9/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.0.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"

# ESP32-P4 silicon revision. P4 revisions >=v3.0 and <3.0 have large hardware
# differences and are NOT binary compatible, so this picks one family and a
# build only runs on boards from that family.
#
# Set for rev v3.x boards (verified on a JC1060P470C with rev v3.2).
# REV_MIN_301 covers v3.1-v3.99 and is the ESP-IDF v6 default; use
# CONFIG_ESP32P4_REV_MIN_300 instead if a board turns up with rev v3.0 (that
# also pulls in the REV3 MSPI workaround, fixed since v3.1).
#
# For an older rev v0.x/v1.x board, replace the line below with:
#   CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
#   CONFIG_ESP32P4_REV_MIN_100=y
# Otherwise esptool refuses to flash: "requires chip revision in range
# [v3.1 - v3.99] (this chip is revision v1.0)".
CONFIG_ESP32P4_REV_MIN_301=y

# JC1060P470C display panel. The flat cable is pin-compatible between the 7-inch
# and 10.1-inch panels, so switching between them is a one-line change here:
#
#   CONFIG_BSP_LCD_TYPE_1024_600=y         7-inch,    1024x600, JD9165
#   CONFIG_BSP_LCD_TYPE_800_1280_JD9365=y  10.1-inch, 800x1280, JD9365
#
CONFIG_BSP_LCD_TYPE_800_1280_JD9365=y

# Frame buffer format. Stays RGB565 for both panels: the 10.1-inch panel wants
# RGB888 on the wire, but the DSI bridge converts on output, so LVGL and the
# frame buffer are unaffected.
CONFIG_BSP_LCD_COLOR_FORMAT_RGB565=y
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=1

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
# The ESP-IDF v6 bootloader no longer fits below the default 0x8000 offset.
CONFIG_PARTITION_TABLE_OFFSET=0xA000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
# Disabled for LVGL 9.5 on ESP-IDF v6: LV_ATTRIBUTE_FAST_MEM=IRAM_ATTR no longer
# fits. With it on, the linker evicts mandatory IRAM code (spi_flash, heap, mmu_hal,
# log) and fails with "--enable-non-contiguous-regions discards section".
# LVGL draw code runs from flash/PSRAM cache instead.
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=n
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_TXT_BREAK_CHARS=" ,.;:-_"
CONFIG_LV_USE_SYSMON=y
CONFIG_LV_USE_PERF_MONITOR=y
CONFIG_LV_USE_IMGFONT=y
CONFIG_LV_USE_DEMO_WIDGETS=y
CONFIG_LV_USE_DEMO_BENCHMARK=y
CONFIG_LV_USE_DEMO_RENDER=y
CONFIG_LV_USE_DEMO_SCROLL=y
CONFIG_LV_USE_DEMO_STRESS=y
CONFIG_LV_USE_DEMO_TRANSFORM=y
CONFIG_LV_USE_DEMO_MUSIC=y
CONFIG_LV_DEMO_MUSIC_AUTO_PLAY=y
CONFIG_LV_USE_DEMO_FLEX_LAYOUT=y
CONFIG_LV_USE_DEMO_MULTILANG=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
